#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# 现在开始试着使用Python内置的函数（built-in functions)
# 共计68个内置函数，参见[Python standard library]:https://docs.python.org/3/library/functions.html
"""
68个内置函数中：
数学函数7个
类型转换函数24个
序列相关函数8个
对象相关函数7个
反射相关函数8个
变量操作函数2个
交互函数2个
文件操作1个
编译执行4个
装饰器3个
"""
# abs()返回一个数的绝对值
print("#######################################")
print("-1.00的绝对值是:", abs(-1.00))
print("0的绝对值是:", abs(0))
print("3.324的绝对值是:", abs(3.324))
# divmod()返回两个数值的商和余数
print("#######################################")
print(divmod(5, 2))
print(divmod(5.5, 2))
# max：返回可迭代对象中的元素中的最大值或者所有参数的最大值
print("#######################################")
print(max(1, 2, 3, 5, 9))
print(max("13579"))  # 字符串也是可迭代对象
print(max(-3, 0, 1, key=abs))  # The key argument specifies a one-argument ordering function
# min：返回可迭代对象中的元素中的最小值或者所有参数的最小值
print(min("135672"))
print(min(1, 3, 6, 2))
print(min(1.1, 3.4, -9.9))
print("#######################################")
# pow：返回两个数值的幂运算值或其与指定整数的模值
print(pow(2, 3))
print(pow(3, 2))
print(min(-1,-2, key=abs))
print("#######################################")
# round：对浮点数进行四舍五入求值
print("四舍五入:", round(1.1314926, 1))  # 第二个参数表示保留的小数位数
print("四舍五入:", round(1.1314926, 5))
print("#######################################")
# sum：对元素类型是数值的可迭代对象中的每个元素求和
print("可迭代对象求和", sum((1, 2, 3, 4), -10))
print("可迭代对象求和", sum((1.5, 2.5, 3.5, 4.5)))
print("#######################################")


